{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm0_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0], [3, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "max_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_max_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm1_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu1", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm2_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu2", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[5, 0, 0], [9, 0, 0], [10, 0, 0], [11, 0, 0], [12, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm3_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu3", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [14, 0, 0], [15, 0, 0], [16, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage1_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm4_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu4", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[13, 0, 0], [17, 0, 0], [18, 0, 0], [19, 0, 0], [20, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm5_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm6_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu5", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [25, 0, 0], [26, 0, 0], [27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm7_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm7_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0], [30, 0, 0], [31, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu6", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu_1", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[21, 0, 0], [22, 0, 0], [23, 0, 0], [24, 0, 0], [32, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm8_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu7", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_3", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0], [34, 0, 0], [35, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage2_conv4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm9_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu8", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu_2", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[33, 0, 0], [37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm10_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm11_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu9", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_4", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0], [45, 0, 0], [46, 0, 0], [47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm12_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm12_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_1", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0], [50, 0, 0], [51, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu10", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu_3", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[41, 0, 0], [42, 0, 0], [43, 0, 0], [44, 0, 0], [52, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm13_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu11", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_5", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0], [54, 0, 0], [55, 0, 0], [56, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage3_conv4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm14_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu12", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu_4", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[53, 0, 0], [57, 0, 0], [58, 0, 0], [59, 0, 0], [60, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv2_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm15_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm16_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu13", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_6", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [65, 0, 0], [66, 0, 0], [67, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv1_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm17_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "batch_norm17_out", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_2", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[68, 0, 0], [69, 0, 0], [70, 0, 0], [71, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "relu14", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu_5", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[61, 0, 0], [62, 0, 0], [63, 0, 0], [64, 0, 0], [72, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv3_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm18_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu15", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_relu_7", 
        "num_inputs": "4", 
        "num_outputs": "1"
      }, 
      "inputs": [[73, 0, 0], [74, 0, 0], [75, 0, 0], [76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_stage4_conv4_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_gamma_mul_div_expand", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "batch_norm19_add_beta_expand", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "relu16", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_conv2d_broadcast_mul_broadcast_add_elemwise_add_relu_6", 
        "num_inputs": "5", 
        "num_outputs": "1"
      }, 
      "inputs": [[73, 0, 0], [77, 0, 0], [78, 0, 0], [79, 0, 0], [80, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "global_avg_pool2d0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_global_avg_pool2d", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[81, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "flatten0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_flatten", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[82, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "resnetv10_dense0_weight", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "resnetv10_dense0_bias", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "dense0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_dense", 
        "num_inputs": "3", 
        "num_outputs": "1"
      }, 
      "inputs": [[83, 0, 0], [84, 0, 0], [85, 0, 0]]
    }, 
    {
      "op": "tvm_op", 
      "name": "softmax0", 
      "attrs": {
        "flatten_data": "0", 
        "func_name": "fuse_softmax", 
        "num_inputs": "1", 
        "num_outputs": "1"
      }, 
      "inputs": [[86, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    2, 
    3, 
    6, 
    7, 
    8, 
    10, 
    11, 
    12, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    29, 
    30, 
    31, 
    34, 
    35, 
    36, 
    38, 
    39, 
    40, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    49, 
    50, 
    51, 
    54, 
    55, 
    56, 
    58, 
    59, 
    60, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    69, 
    70, 
    71, 
    74, 
    75, 
    76, 
    78, 
    79, 
    80, 
    84, 
    85
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88
  ], 
  "heads": [[87, 0, 0]], 
  "attrs": {
    "storage_allocated_bytes": ["size_t", 4925248], 
    "storage_id": ["list_int", [
        -1, 
        -1, 
        -1, 
        -1, 
        0, 
        1, 
        -1, 
        -1, 
        -1, 
        0, 
        -1, 
        -1, 
        -1, 
        2, 
        -1, 
        -1, 
        -1, 
        1, 
        -1, 
        -1, 
        -1, 
        0, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        2, 
        -1, 
        -1, 
        -1, 
        1, 
        2, 
        -1, 
        -1, 
        -1, 
        1, 
        -1, 
        -1, 
        -1, 
        0, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        2, 
        -1, 
        -1, 
        -1, 
        1, 
        2, 
        -1, 
        -1, 
        -1, 
        1, 
        -1, 
        -1, 
        -1, 
        0, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        2, 
        -1, 
        -1, 
        -1, 
        1, 
        2, 
        -1, 
        -1, 
        -1, 
        1, 
        -1, 
        -1, 
        -1, 
        3, 
        4, 
        5, 
        -1, 
        -1, 
        4, 
        5]], 
    "storage_inplace_index": ["list_int", [
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1, 
        -1]], 
    "shape": ["list_shape", [
        [1, 3, 224, 224], 
        [64, 3, 7, 7], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 112, 112], 
        [1, 64, 56, 56], 
        [64, 64, 3, 3], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [64, 64, 3, 3], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [64, 64, 3, 3], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [64, 64, 3, 3], 
        [64, 1, 1], 
        [64, 1, 1], 
        [1, 64, 56, 56], 
        [128, 64, 1, 1], 
        [128, 1, 1], 
        [128, 1, 1], 
        [128, 64, 3, 3], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [128, 128, 3, 3], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [1, 128, 28, 28], 
        [128, 128, 3, 3], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [128, 128, 3, 3], 
        [128, 1, 1], 
        [128, 1, 1], 
        [1, 128, 28, 28], 
        [256, 128, 1, 1], 
        [256, 1, 1], 
        [256, 1, 1], 
        [256, 128, 3, 3], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [256, 256, 3, 3], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [1, 256, 14, 14], 
        [256, 256, 3, 3], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [256, 256, 3, 3], 
        [256, 1, 1], 
        [256, 1, 1], 
        [1, 256, 14, 14], 
        [512, 256, 1, 1], 
        [512, 1, 1], 
        [512, 1, 1], 
        [512, 256, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [512, 512, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [1, 512, 7, 7], 
        [512, 512, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [512, 512, 3, 3], 
        [512, 1, 1], 
        [512, 1, 1], 
        [1, 512, 7, 7], 
        [1, 512, 1, 1], 
        [1, 512], 
        [1000, 512], 
        [1000], 
        [1, 1000], 
        [1, 1000]]], 
    "dtype": ["list_int", [
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0, 
        0]], 
    "storage_num_not_allocated": ["size_t", 0], 
    "dltype": ["list_str", [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"]]
  }
}